{
    "title": "Child Mind Institute — Problematic Internet Use",
    "overview": "Overview\nCan you predict the level of problematic internet usage exhibited by children and adolescents, based on their physical activity? The goal of this competition is to develop a predictive model that analyzes children's physical activity and fitness data to identify early signs of problematic internet use. Identifying these patterns can help trigger interventions to encourage healthier digital habits.\n\nDescription\nIn today’s digital age, problematic internet use among children and adolescents is a growing concern. Better understanding this issue is crucial for addressing mental health problems such as depression and anxiety.\n\nCurrent methods for measuring problematic internet use in children and adolescents are often complex and require professional assessments. This creates access, cultural, and linguistic barriers for many families. Due to these limitations, problematic internet use is often not measured directly, but is instead associated with issues such as depression and anxiety in youth.\n\nConversely, physical & fitness measures are extremely accessible and widely available with minimal intervention or clinical expertise. Changes in physical habits, such as poorer posture, irregular diet, and reduced physical activity, are common in excessive technology users. We propose using these easily obtainable physical fitness indicators as proxies for identifying problematic internet use, especially in contexts lacking clinical expertise or suitable assessment tools.\n\nThis competition challenges you to develop a predictive model capable of analyzing children's physical activity data to detect early indicators of problematic internet and technology use. This will enable prompt interventions aimed at promoting healthier digital habits.\n\nYour work will contribute to a healthier, happier future where children are better equipped to navigate the digital landscape responsibly.\n\nEvaluation\nSubmissions are scored based on the quadratic weighted kappa, which measures the agreement between two outcomes. This metric typically varies from 0 (random agreement) to 1 (complete agreement). In the event that there is less agreement than expected by chance, the metric may go below 0.\n\nTo compute the quadratic weighted kappa, we construct three matrices, O, W, and E, with N the number of distinct labels.\n\nThe matrix O is an N×N histogram matrix such that Oi,j corresponds to the number of instances that have an actual value i and a predicted value j.\n\nThe matrix W is an N×N matrix of weights, calculated based on the squared difference between actual and predicted values:\n\nW_ij = ((i - j)^2) / ((N - 1)^2)\n\nThe matrix E is an N×N histogram matrix of expected outcomes, calculated assuming that there is no correlation between values. This is calculated as the outer product between the actual histogram vector of outcomes and the predicted histogram vector, normalized such that E and O have the same sum.\n\nFrom these three matrices, the quadratic weighted kappa is calculated as: \n\nκ = 1 - (Σ_ij W_ij O_ij) / (Σ_ij W_ij E_ij).",
    "type": "Classification",
    "model": [
        "Keras",
        "ptyorch",
        "Lightgbm",
        "Catboost"
    ],
    "code": "multi-model-feature-importance-analysis.ipynb",
    "url": "https://www.kaggle.com/code/k14herine/multi-model-feature-importance-analysis",
    "score": 0.498,
    "evaluation": "Quadratic weghted kappa",
    "max score": 0.501,
    "min score": 0.497,
    "medal": "Gold"
}