{
    "title": "Store Sales - Time Series Forecasting",
    "overview": "Description\nGoal of the Competition\nIn this “getting started” competition, you’ll use time-series forecasting to forecast store sales on data from Corporación Favorita, a large Ecuadorian-based grocery retailer.\n\nSpecifically, you'll build a model that more accurately predicts the unit sales for thousands of items sold at different Favorita stores. You'll practice your machine learning skills with an approachable training dataset of dates, store, and item information, promotions, and unit sales.\n\nGet Started\nWe highly recommend the Time Series course, which walks you through how to make your first submission. The lessons in this course are inspired by winning solutions from past Kaggle time series forecasting competitions.\nContext\nForecasts aren’t just for meteorologists. Governments forecast economic growth. Scientists attempt to predict the future population. And businesses forecast product demand—a common task of professional data scientists. Forecasts are especially relevant to brick-and-mortar grocery stores, which must dance delicately with how much inventory to buy. Predict a little over, and grocers are stuck with overstocked, perishable goods. Guess a little under, and popular items quickly sell out, leading to lost revenue and upset customers. More accurate forecasting, thanks to machine learning, could help ensure retailers please customers by having just enough of the right products at the right time.\n\nCurrent subjective forecasting methods for retail have little data to back them up and are unlikely to be automated. The problem becomes even more complex as retailers add new locations with unique needs, new products, ever-transitioning seasonal tastes, and unpredictable product marketing.\n\nPotential Impact\nIf successful, you'll have flexed some new skills in a real world example. For grocery stores, more accurate forecasting can decrease food waste related to overstocking and improve customer satisfaction. The results of this ongoing competition, over time, might even ensure your local store has exactly what you need the next time you shop.\n\nEvaluation\nThe evaluation metric for this competition is Root Mean Squared Logarithmic Error.\n\nThe RMSLE is calculated as:\nsqrt((1 / n) * sum_{i=1}^n (log(1 + ŷ_i) - log(1 + y_i))^2)\nwhere:\n\nn\n is the total number of instances,\nŷ_i\n is the predicted value of the target for instance (i),\ny_i\n is the actual value of the target for instance (i), and,\nlog\n is the natural logarithm.\nSubmission File\nFor each id in the test set, you must predict a value for the sales variable. The file should contain a header and have the following format:\n\nid,sales\n3000888,0.0\n3000889,0.0\n3000890,0.0\n3000891,0.0\n3000892,0.0\netc.",
    "type": "Time series",
    "model": [
        "Lightgbm"
    ],
    "code": "time-series-ensemble.ipynb",
    "url": "https://www.kaggle.com/code/eishkaran/time-series-ensemble",
    "score": 0.38129,
    "evaluation": "Regression Error(MAE,R^2,RMSE,RMSLE)",
    "max score": 0.37741,
    "min score": 0.39228,
    "relative score": 0.739071956960323,
    "medal": "Silver"
}