{
    "title": "Optiver - Trading at the Close",
    "overview": "Overview\nIn this competition, you are challenged to develop a model capable of predicting the closing price movements for hundreds of Nasdaq listed stocks using data from the order book and the closing auction of the stock. Information from the auction can be used to adjust prices, assess supply and demand dynamics, and identify trading opportunities.\n\nDescription\nStock exchanges are fast-paced, high-stakes environments where every second counts. The intensity escalates as the trading day approaches its end, peaking in the critical final ten minutes. These moments, often characterised by heightened volatility and rapid price fluctuations, play a pivotal role in shaping the global economic narrative for the day.\n\nEach trading day on the Nasdaq Stock Exchange concludes with the Nasdaq Closing Cross auction. This process establishes the official closing prices for securities listed on the exchange. These closing prices serve as key indicators for investors, analysts and other market participants in evaluating the performance of individual securities and the market as a whole.\n\nWithin this complex financial landscape operates Optiver, a leading global electronic market maker. Fueled by technological innovation, Optiver trades a vast array of financial instruments, such as derivatives, cash equities, ETFs, bonds, and foreign currencies, offering competitive, two-sided prices for thousands of these instruments on major exchanges worldwide.\n\nIn the last ten minutes of the Nasdaq exchange trading session, market makers like Optiver merge traditional order book data with auction book data. This ability to consolidate information from both sources is critical for providing the best prices to all market participants.\n\nIn this competition, you are challenged to develop a model capable of predicting the closing price movements for hundreds of Nasdaq listed stocks using data from the order book and the closing auction of the stock. Information from the auction can be used to adjust prices, assess supply and demand dynamics, and identify trading opportunities.\n\nYour model can contribute to the consolidation of signals from the auction and order book, leading to improved market efficiency and accessibility, particularly during the intense final ten minutes of trading. You'll also get firsthand experience in handling real-world data science problems, similar to those faced by traders, quantitative researchers and engineers at Optiver.\n\nEvaluation\nSubmissions are evaluated on the Mean Absolute Error (MAE) between the predicted return and the observed target. The formula is given by:\n\nMAE = (1 / n) * sum_{i=1}^n |y_i - x_i|\n\nWhere:\n\nn is the total number of data points.\ny_i is the predicted value for data point i.\nx_i is the observed value for data point i.\nSubmitting\nYou must submit to this competition using the provided python time-series API, which ensures that models do not peek forward in time. To use the API, follow the template in this notebook.\n",
    "type": "Time series",
    "model": [
        "XGBoost",
        "Lightgbm",
        "Catboost"
    ],
    "code": "k-fold-time-series-split-w-selective-ensemble.ipynb",
    "score": 4.7237,
    "evaluation": "Regression Error(MAE,R^2,RMSE,RMSLE)",
    "min score": 5.4708,
    "medal": "Gold"
}